In [1]:
import pandas as pd

In [3]:
df1 = pd.read_csv("bike.csv")
df1.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [4]:
df1["season"].unique()

array([1, 2, 3, 4], dtype=int64)

In [9]:
df1["datetime"] = pd.to_datetime(df1["datetime"])
df1["datetime"].dtype

dtype('<M8[ns]')

In [11]:
df1["hour"] = df1["datetime"].dt.hour
df1.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,hour
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,0
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,1

In [12]:
df1_summer = df1.loc[df1["season"] == 2, ]
df1_winter = df1.loc[df1["season"] == 4, ]
print(len(df1_summer), len(df1_winter))

2733 2734

In [13]:
df1_ss = df1_summer.groupby(["hour"])["registered"].mean().reset_index()
df1_ss.head(2)

   hour  registered
0     0   45.947368
1     1   27.473684

In [14]:
df1_ww = df1_winter.groupby(["hour"])["registered"].mean().reset_index()
df1_ww.head(2)

   hour  registered
0     0   50.017544
1     1   30.842105

In [15]:
df1_ans = pd.concat([df1_ss, df1_ww], axis = 1)
df1_ans.head()

   hour  registered  hour  registered
0     0   45.947368     0   50.017544
1     1   27.473684     1   30.842105
2     2   17.763158     2   18.973684
3     3    8.419643     3    9.116071
4     4    5.053097     4    6.087719

In [17]:
df1_ans.columns = ["h1", "r1", "h2", "r2"]
df1_ans.head(2)

   h1         r1  h2         r2
0   0  45.947368   0  50.017544
1   1  27.473684   1  30.842105

In [18]:
df1_ans["diff"] = abs(df1_ans["r1"] - df1_ans["r2"])
df1_ans.head(2)

   h1         r1  h2         r2      diff
0   0  45.947368   0  50.017544  4.070175
1   1  27.473684   1  30.842105  3.368421

In [19]:
df1_ans["diff"].idxmax()

19

In [20]:
df1.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,hour
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,0
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,1

In [24]:
df2 = pd.read_csv("bike.csv")
df2.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [25]:
df2["date"] = df2["datetime"].str.slice(0, 10)
df2.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,date
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,2011-01-01
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,2011-01-01
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32,2011-01-01
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13,2011-01-01
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1,2011-01-01

In [26]:
df2_tt = df2.groupby(["date"])["humidity"].max().reset_index()
df2_tt.head(2)

         date  humidity
0  2011-01-01        94
1  2011-01-02       100

In [27]:
df2_tt = df2_tt.loc[df2_tt["humidity"] == 100, ]
df2_tt.head(2)

          date  humidity
1   2011-01-02       100
20  2011-02-02       100

In [28]:
df2_aa = df2_tt.merge(df2, on = "date")
df2_aa.head(2)

,date,humidity_x,datetime,season,holiday,workingday,weather,temp,atemp,humidity_y,windspeed,casual,registered,count
0,2011-01-02,100,2011-01-02 00:00:00,1,0,0,2,18.86,22.725,88,19.9995,4,13,17
1,2011-01-02,100,2011-01-02 01:00:00,1,0,0,2,18.04,21.970,94,16.9979,1,16,17

In [29]:
df2_aa.shape

(952, 14)

In [ ]:
df2_aa = df2_aa.loc[df2_aa["temp"] > 30, ]
df2_aa["count"]